<template>
  <div class="assemble-guide">
    <div class="assemble-guide-content">
      <div class="assemble-guide-img">
        <svg
          xml:space="preserve"
          viewBox="0 0 700 280"
          width="100%"
          height="100%"
          fill="currentColor"
          aria-hidden="true"
          focusable="false"
          class=""
        >
          <path
            style="fill: #ffffff"
            d="M8,30.244h305.727c4.418,0,8,3.582,8,8v203.512c0,4.418-3.582,8-8,8H8c-4.418,0-8-3.582-8-8V38.244
	C0,33.826,3.582,30.244,8,30.244z"
          />
          <path
            style="fill-opacity: 0.02"
            d="M20.574,72.195h131.415c2.209,0,4,1.791,4,4v69.073c0,2.209-1.791,4-4,4H20.574
	c-2.209,0-4-1.791-4-4V76.195C16.574,73.986,18.365,72.195,20.574,72.195z"
          />
          <path
            style="fill-opacity: 0.02"
            d="M20.574,160.977h80.719c2.209,0,4,1.791,4,4v69.073c0,2.209-1.791,4-4,4H20.574
	c-2.209,0-4-1.791-4-4v-69.073C16.574,162.768,18.365,160.977,20.574,160.977z"
          />
          <path
            style="fill-opacity: 0.02"
            d="M120.992,160.977h81.694c2.209,0,4,1.791,4,4v69.073c0,2.209-1.791,4-4,4h-81.694
	c-2.209,0-4-1.791-4-4v-69.073C116.992,162.768,118.783,160.977,120.992,160.977z"
          />
          <path
            style="fill: var(--w-primary-color); fill-opacity: 0.2"
            d="M222.384,160.977h80.719c2.209,0,4,1.791,4,4v69.073c0,2.209-1.791,4-4,4h-80.719
	c-2.209,0-4-1.791-4-4v-69.073C218.384,162.768,220.175,160.977,222.384,160.977z"
          />
          <path
            style="fill: var(--w-primary-color); fill-opacity: 0.2"
            d="M171.688,72.195h131.415c2.209,0,4,1.791,4,4v69.073c0,2.209-1.791,4-4,4H171.688
	c-2.209,0-4-1.791-4-4V76.195C167.688,73.986,169.479,72.195,171.688,72.195z"
          />
          <path
            style="fill: #ffffff"
            d="M386.273,30.244H692c4.418,0,8,3.582,8,8v203.512c0,4.418-3.582,8-8,8H386.273c-4.418,0-8-3.582-8-8
	V38.244C378.273,33.826,381.855,30.244,386.273,30.244z"
          />
          <path
            style="fill: var(--w-primary-color); fill-opacity: 0.2"
            d="M398.847,72.195h131.415c2.209,0,4,1.791,4,4v69.073c0,2.209-1.791,4-4,4H398.847
	c-2.209,0-4-1.791-4-4V76.195C394.847,73.986,396.638,72.195,398.847,72.195z"
          />
          <path
            style="fill: var(--w-primary-color); fill-opacity: 0.2"
            d="M398.847,160.977h80.719c2.209,0,4,1.791,4,4v69.073c0,2.209-1.791,4-4,4h-80.719
	c-2.209,0-4-1.791-4-4v-69.073C394.847,162.768,396.638,160.977,398.847,160.977z"
          />
          <path
            style="fill-opacity: 0.02"
            d="M499.265,160.977h81.694c2.209,0,4,1.791,4,4v69.073c0,2.209-1.791,4-4,4h-81.694
	c-2.209,0-4-1.791-4-4v-69.073C495.265,162.768,497.056,160.977,499.265,160.977z"
          />
          <path
            style="fill-opacity: 0.02"
            d="M600.657,160.977h80.719c2.209,0,4,1.791,4,4v69.073c0,2.209-1.791,4-4,4h-80.719
	c-2.209,0-4-1.791-4-4v-69.073C596.657,162.768,598.448,160.977,600.657,160.977z"
          />
          <path
            style="fill-opacity: 0.02"
            d="M549.961,72.195h131.415c2.209,0,4,1.791,4,4v69.073c0,2.209-1.791,4-4,4H549.961
	c-2.209,0-4-1.791-4-4V76.195C545.961,73.986,547.752,72.195,549.961,72.195z"
          />
          <ellipse style="fill: #ffffff" cx="395.822" cy="45.367" rx="5.85" ry="6.341" />
          <ellipse style="fill: #ffffff" cx="417.27" cy="45.367" rx="5.85" ry="6.341" />
          <ellipse style="fill: #ffffff" cx="438.719" cy="45.367" rx="5.85" ry="6.341" />
          <path
            style="fill: #ffffff"
            d="M156.189,0H549.66c4.418,0,8,3.582,8,8v264c0,4.418-3.582,8-8,8H156.189c-4.418,0-8-3.582-8-8V8
	C148.189,3.582,151.771,0,156.189,0z"
          />
          <g id="替换1">
            <path
              style="fill: var(--w-primary-color)"
              d="M692,30.244H557.66V8c0-4.418-3.582-8-8-8H156.189c-4.418,0-8,3.582-8,8v22.244H8
		c-4.418,0-8,3.582-8,8v22.244h148.189V39.024H557.66v21.464H700V38.244C700,33.826,696.418,30.244,692,30.244z"
            />
          </g>
          <ellipse style="fill: #ffffff; fill-opacity: 0.9" cx="17.549" cy="45.854" rx="5.85" ry="5.854" />
          <ellipse style="fill: #ffffff; fill-opacity: 0.9" cx="38.997" cy="45.854" rx="5.85" ry="5.854" />
          <ellipse style="fill: #ffffff; fill-opacity: 0.9" cx="60.446" cy="45.854" rx="5.85" ry="5.854" />
          <path
            style="fill-opacity: 0.02"
            d="M392.947,147.316h147.114c1.105,0,2,0.895,2,2v113.073c0,1.105-0.895,2-2,2H392.947
	c-1.105,0-2-0.895-2-2V149.316C390.947,148.211,391.842,147.316,392.947,147.316z"
          />
          <path
            style="fill: #e5e5e5"
            d="M403.624,156.098h78.963c2.694,0,4.878,2.184,4.878,4.878l0,0c0,2.694-2.184,4.878-4.878,4.878
	h-78.963c-2.694,0-4.878-2.184-4.878-4.878l0,0C398.746,158.282,400.93,156.098,403.624,156.098z"
          />
          <path
            style="fill: #e5e5e5"
            d="M422.145,245.855V232.19c0-2.692,2.182-4.875,4.875-4.875l0,0c2.692,0,4.875,2.182,4.875,4.875
	v13.665c0,2.692-2.182,4.875-4.875,4.875l0,0C424.327,250.73,422.145,248.548,422.145,245.855z"
          />
          <path
            style="fill: #e5e5e5"
            d="M480.641,245.855v-24.397c0-2.692,2.182-4.875,4.875-4.875h0c2.692,0,4.875,2.182,4.875,4.875v24.397
	c0,2.692-2.182,4.875-4.875,4.875h0C482.823,250.73,480.641,248.548,480.641,245.855z"
          />
          <path
            style="fill: #cccccc"
            d="M441.643,245.855v-21.47c0-2.692,2.182-4.875,4.875-4.875h0c2.692,0,4.875,2.182,4.875,4.875v21.47
	c0,2.692-2.182,4.875-4.875,4.875h0C443.825,250.73,441.643,248.548,441.643,245.855z"
          />
          <path
            style="fill: #cccccc"
            d="M519.638,245.855v-47.812c0-2.692,2.182-4.875,4.875-4.875l0,0c2.692,0,4.875,2.182,4.875,4.875
	v47.812c0,2.692-2.182,4.875-4.875,4.875l0,0C521.82,250.73,519.638,248.548,519.638,245.855z"
          />
          <path
            style="fill: #e5e5e5"
            d="M401.673,171.707h52.642c1.616,0,2.927,1.31,2.927,2.927v0c0,1.616-1.31,2.927-2.927,2.927h-52.642
	c-1.616,0-2.927-1.31-2.927-2.927v0C398.746,173.017,400.056,171.707,401.673,171.707z"
          />
          <path
            style="fill: #e5e5e5"
            d="M401.673,183.414h52.642c1.616,0,2.927,1.31,2.927,2.927v0c0,1.616-1.31,2.927-2.927,2.927h-52.642
	c-1.616,0-2.927-1.31-2.927-2.927v0C398.746,184.724,400.056,183.414,401.673,183.414z"
          />
          <linearGradient
            id="SVGID_1_"
            gradientUnits="userSpaceOnUse"
            x1="590.0627"
            y1="-50.7841"
            x2="723.2217"
            y2="67.173"
            gradientTransform="matrix(1 0 0 -1 -252 46)"
          >
            <stop offset="0" style="stop-color: #000000; stop-opacity: 0.05" />
            <stop offset="1" style="stop-color: #000000; stop-opacity: 0" />
          </linearGradient>
          <path style="fill: url(#SVGID_1_)" d="M74,109.171L162.231,56h377.786v83.415l-86.769,60.487l-0.488-89.756L74,109.171z" />
          <path
            style="fill: none; stroke: #000000; stroke-opacity: 0.2; stroke-dasharray: 2, 2"
            d="M164.813,55.135h375.248
	c0.828,0,1.5,0.672,1.5,1.5v80.878c0,0.828-0.672,1.5-1.5,1.5H164.813c-0.828,0-1.5-0.672-1.5-1.5V56.635
	C163.313,55.806,163.985,55.135,164.813,55.135z"
          />
          <path
            style="fill-opacity: 0.02"
            d="M164.813,147.316H267.08c1.105,0,2,0.895,2,2v113.073c0,1.105-0.895,2-2,2H164.813
	c-1.105,0-2-0.895-2-2V149.316C162.813,148.211,163.708,147.316,164.813,147.316z"
          />
          <path
            style="fill-opacity: 0.02"
            d="M278.88,147.316h102.267c1.105,0,2,0.895,2,2v50.634c0,1.105-0.895,2-2,2H278.88
	c-1.105,0-2-0.895-2-2v-50.634C276.88,148.211,277.775,147.316,278.88,147.316z"
          />
          <path
            style="fill-opacity: 0.02"
            d="M278.88,209.756h102.267c1.105,0,2,0.895,2,2v50.634c0,1.105-0.895,2-2,2H278.88
	c-1.105,0-2-0.895-2-2v-50.634C276.88,210.651,277.775,209.756,278.88,209.756z"
          />
          <ellipse style="fill: #ffffff; fill-opacity: 0.9" cx="170.613" cy="19.512" rx="7.799" ry="7.805" />
          <ellipse style="fill: #ffffff; fill-opacity: 0.9" cx="197.911" cy="19.512" rx="7.799" ry="7.805" />
          <ellipse style="fill: #ffffff; fill-opacity: 0.9" cx="225.209" cy="19.512" rx="7.799" ry="7.805" />
          <ellipse style="fill: var(--w-primary-color)" cx="182.312" cy="165.854" rx="9.749" ry="9.756" />
          <path
            style="fill: #e5e5e5"
            d="M200.838,159.025h25.344c1.616,0,2.927,1.31,2.927,2.927v0c0,1.616-1.31,2.927-2.927,2.927h-25.344
	c-1.616,0-2.927-1.31-2.927-2.927v0C197.911,160.335,199.221,159.025,200.838,159.025z"
          />
          <path
            style="fill: #e5e5e5"
            d="M199.862,168.781h57.518c1.078,0,1.951,0.874,1.951,1.951l0,0c0,1.078-0.874,1.951-1.951,1.951
	h-57.518c-1.078,0-1.951-0.874-1.951-1.951l0,0C197.911,169.655,198.785,168.781,199.862,168.781z"
          />
          <path
            style="fill: #e5e5e5"
            d="M200.838,213.66h25.344c1.616,0,2.927,1.31,2.927,2.927v0c0,1.616-1.31,2.927-2.927,2.927h-25.344
	c-1.616,0-2.927-1.31-2.927-2.927v0C197.911,214.97,199.221,213.66,200.838,213.66z"
          />
          <path
            style="fill: #e5e5e5"
            d="M199.862,223.416h57.518c1.078,0,1.951,0.874,1.951,1.951l0,0c0,1.078-0.874,1.951-1.951,1.951
	h-57.518c-1.078,0-1.951-0.874-1.951-1.951l0,0C197.911,224.29,198.785,223.416,199.862,223.416z"
          />
          <path
            style="fill: #e5e5e5"
            d="M200.838,186.342h25.344c1.616,0,2.927,1.31,2.927,2.927v0c0,1.616-1.31,2.927-2.927,2.927h-25.344
	c-1.616,0-2.927-1.31-2.927-2.927v0C197.911,187.652,199.221,186.342,200.838,186.342z"
          />
          <path
            style="fill: #e5e5e5"
            d="M199.862,196.098h57.518c1.078,0,1.951,0.874,1.951,1.951l0,0c0,1.078-0.874,1.951-1.951,1.951
	h-57.518c-1.078,0-1.951-0.874-1.951-1.951l0,0C197.911,196.972,198.785,196.098,199.862,196.098z"
          />
          <path
            style="fill: #e5e5e5"
            d="M200.838,240.977h25.344c1.616,0,2.927,1.31,2.927,2.927v0c0,1.616-1.31,2.927-2.927,2.927h-25.344
	c-1.616,0-2.927-1.31-2.927-2.927v0C197.911,242.287,199.221,240.977,200.838,240.977z"
          />
          <path
            style="fill: #e5e5e5"
            d="M199.862,250.732h57.518c1.078,0,1.951,0.874,1.951,1.951l0,0c0,1.078-0.874,1.951-1.951,1.951
	h-57.518c-1.078,0-1.951-0.874-1.951-1.951l0,0C197.911,251.606,198.785,250.732,199.862,250.732z"
          />
          <rect x="160.863" y="52.684" style="fill: #999999" width="4.875" height="4.878" />
          <rect x="539.136" y="52.684" style="fill: #999999" width="4.875" height="4.878" />
          <rect x="350" y="52.684" style="fill: #999999" width="4.875" height="4.878" />
          <rect x="160.863" y="136.586" style="fill: #999999" width="4.875" height="4.878" />
          <rect x="539.136" y="136.586" style="fill: #999999" width="4.875" height="4.878" />
          <rect x="350" y="136.586" style="fill: #999999" width="4.875" height="4.878" />
          <path
            style="fill: #e5e5e5"
            d="M288.68,154.146h7.599c2.209,0,4,1.791,4,4v7.61c0,2.209-1.791,4-4,4h-7.599c-2.209,0-4-1.791-4-4
	v-7.61C284.68,155.937,286.471,154.146,288.68,154.146z"
          />
          <path
            style="fill: #e5e5e5"
            d="M288.68,216.586h7.599c2.209,0,4,1.791,4,4v7.61c0,2.209-1.791,4-4,4h-7.599c-2.209,0-4-1.791-4-4
	v-7.61C284.68,218.377,286.471,216.586,288.68,216.586z"
          />
          <g id="替换4">
            <path
              style="fill: var(--w-primary-color)"
              d="M402.646,245.855v-4.885c0-2.692,2.182-4.875,4.875-4.875h0c2.692,0,4.875,2.182,4.875,4.875v4.885
		c0,2.692-2.182,4.875-4.875,4.875h0C404.828,250.73,402.646,248.548,402.646,245.855z"
            />
            <path
              style="fill: var(--w-primary-color)"
              d="M500.139,245.855v-31.226c0-2.692,2.182-4.875,4.875-4.875l0,0c2.692,0,4.875,2.182,4.875,4.875
		v31.226c0,2.692-2.182,4.875-4.875,4.875l0,0C502.321,250.73,500.139,248.548,500.139,245.855z"
            />
            <path
              style="fill: var(--w-primary-color)"
              d="M461.142,245.855v-36.104c0-2.692,2.182-4.875,4.875-4.875l0,0c2.692,0,4.875,2.182,4.875,4.875
		v36.104c0,2.692-2.182,4.875-4.875,4.875l0,0C463.324,250.73,461.142,248.548,461.142,245.855z"
            />
            <ellipse style="fill: var(--w-primary-color)" cx="182.312" cy="220.489" rx="9.749" ry="9.756" />
            <ellipse style="fill: var(--w-primary-color)" cx="182.312" cy="193.17" rx="9.749" ry="9.756" />
            <ellipse style="fill: var(--w-primary-color)" cx="182.312" cy="247.805" rx="9.749" ry="9.756" />
            <path
              style="fill: var(--w-primary-color)"
              d="M358.777,188.293h11.694c2.155,0,3.902,1.747,3.902,3.902v0c0,2.155-1.747,3.902-3.902,3.902
		h-11.694c-2.155,0-3.902-1.747-3.902-3.902v0C354.875,190.04,356.622,188.293,358.777,188.293z"
            />
            <path
              style="fill: var(--w-primary-color)"
              d="M358.777,250.732h11.694c2.155,0,3.902,1.747,3.902,3.902l0,0c0,2.155-1.747,3.902-3.902,3.902
		h-11.694c-2.155,0-3.902-1.747-3.902-3.902l0,0C354.875,252.479,356.622,250.732,358.777,250.732z"
            />
          </g>
          <path
            style="fill: #e5e5e5"
            d="M287.606,173.658h84.816c1.078,0,1.951,0.874,1.951,1.951l0,0c0,1.078-0.874,1.951-1.951,1.951
	h-84.816c-1.078,0-1.951-0.874-1.951-1.951l0,0C285.655,174.532,286.529,173.658,287.606,173.658z"
          />
          <path
            style="fill: #e5e5e5"
            d="M287.606,236.098h84.816c1.078,0,1.951,0.874,1.951,1.951l0,0c0,1.078-0.874,1.951-1.951,1.951
	h-84.816c-1.078,0-1.951-0.874-1.951-1.951l0,0C285.655,236.972,286.529,236.098,287.606,236.098z"
          />
          <path
            style="fill: #e5e5e5"
            d="M287.606,181.463H342.2c1.078,0,1.951,0.874,1.951,1.951l0,0c0,1.078-0.874,1.951-1.951,1.951
	h-54.593c-1.078,0-1.951-0.874-1.951-1.951l0,0C285.655,182.337,286.529,181.463,287.606,181.463z"
          />
          <path
            style="fill: #e5e5e5"
            d="M287.606,243.902H342.2c1.078,0,1.951,0.874,1.951,1.951l0,0c0,1.078-0.874,1.951-1.951,1.951
	h-54.593c-1.078,0-1.951-0.874-1.951-1.951l0,0C285.655,244.776,286.529,243.902,287.606,243.902z"
          />
          <path
            style="fill: #ffffff; fill-opacity: 0.8"
            d="M78,108h372.223c2.209,0,4,1.791,4,4v85.659c0,2.209-1.791,4-4,4H78
	c-2.209,0-4-1.791-4-4V112C74,109.791,75.791,108,78,108z"
          />
          <path
            style="fill: none; stroke: #000000; stroke-opacity: 0.05"
            d="M78,108.5h372.223c1.933,0,3.5,1.567,3.5,3.5v85.659
	c0,1.933-1.567,3.5-3.5,3.5H78c-1.933,0-3.5-1.567-3.5-3.5V112C74.5,110.067,76.067,108.5,78,108.5z"
          />
          <g id="替换3">
            <path
              style="fill: var(--w-primary-color)"
              d="M94.574,128.488h46.596c2.209,0,4,1.791,4,4v47.61c0,2.209-1.791,4-4,4H94.574c-2.209,0-4-1.791-4-4
		v-47.61C90.574,130.279,92.365,128.488,94.574,128.488z"
            />
            <path
              style="fill: var(--w-primary-color)"
              d="M160.869,128.488h46.596c2.209,0,4,1.791,4,4v47.61c0,2.209-1.791,4-4,4h-46.596
		c-2.209,0-4-1.791-4-4v-47.61C156.869,130.279,158.66,128.488,160.869,128.488z"
            />
          </g>
          <path
            style="fill: #fdc58a"
            d="M233.989,132.391h11.499c2.209,0,4,1.791,4,4v11.512c0,2.209-1.791,4-4,4h-11.499
	c-2.209,0-4-1.791-4-4v-11.512C229.989,134.182,231.78,132.391,233.989,132.391z"
          />
          <path
            style="fill: #fdc58a"
            d="M233.989,160.684h11.499c2.209,0,4,1.791,4,4v11.512c0,2.209-1.791,4-4,4h-11.499
	c-2.209,0-4-1.791-4-4v-11.512C229.989,162.475,231.78,160.684,233.989,160.684z"
          />
          <path
            style="fill: #fdc58a"
            d="M345.131,132.391h11.499c2.209,0,4,1.791,4,4v11.512c0,2.209-1.791,4-4,4h-11.499
	c-2.209,0-4-1.791-4-4v-11.512C341.131,134.182,342.922,132.391,345.131,132.391z"
          />
          <path
            style="fill: #fdc58a"
            d="M345.131,160.684h11.499c2.209,0,4,1.791,4,4v11.512c0,2.209-1.791,4-4,4h-11.499
	c-2.209,0-4-1.791-4-4v-11.512C341.131,162.475,342.922,160.684,345.131,160.684z"
          />
          <path
            style="fill: #fff9f3"
            d="M259.337,132.391h62.195c2.209,0,4,1.791,4,4v11.512c0,2.209-1.791,4-4,4h-62.195
	c-2.209,0-4-1.791-4-4v-11.512C255.337,134.182,257.128,132.391,259.337,132.391z"
          />
          <path
            style="fill: #fff9f3"
            d="M259.337,160.684h62.195c2.209,0,4,1.791,4,4v11.512c0,2.209-1.791,4-4,4h-62.195
	c-2.209,0-4-1.791-4-4v-11.512C255.337,162.475,257.128,160.684,259.337,160.684z"
          />
          <path
            style="fill: #fff9f3"
            d="M370.479,132.391h62.195c2.209,0,4,1.791,4,4v11.512c0,2.209-1.791,4-4,4h-62.195
	c-2.209,0-4-1.791-4-4v-11.512C366.479,134.182,368.27,132.391,370.479,132.391z"
          />
          <path
            style="fill: #fff9f3"
            d="M370.479,160.684h62.195c2.209,0,4,1.791,4,4v11.512c0,2.209-1.791,4-4,4h-62.195
	c-2.209,0-4-1.791-4-4v-11.512C366.479,162.475,368.27,160.684,370.479,160.684z"
          />
          <path
            style="fill: #ffffff; fill-opacity: 0.8"
            d="M473.916,48H617.03c2.209,0,4,1.791,4,4v45.658c0,2.209-1.791,4-4,4H473.916
	c-2.209,0-4-1.791-4-4V52C469.916,49.791,471.707,48,473.916,48z"
          />
          <path
            style="fill: none; stroke: #000000; stroke-opacity: 0.1"
            d="M473.916,48.5H617.03c1.933,0,3.5,1.567,3.5,3.5v45.658
	c0,1.933-1.567,3.5-3.5,3.5H473.916c-1.933,0-3.5-1.567-3.5-3.5V52C470.416,50.067,471.983,48.5,473.916,48.5z"
          />
          <path
            style="fill: #e5e5e5"
            d="M488.442,59.707h114.061c2.155,0,3.902,1.747,3.902,3.902l0,0c0,2.155-1.747,3.902-3.902,3.902
	H488.442c-2.155,0-3.902-1.747-3.902-3.902l0,0C484.54,61.454,486.287,59.707,488.442,59.707z"
          />
          <path
            style="fill: #e5e5e5"
            d="M488.442,81.17h114.061c2.155,0,3.902,1.747,3.902,3.902v0c0,2.155-1.747,3.902-3.902,3.902H488.442
	c-2.155,0-3.902-1.747-3.902-3.902v0C484.54,82.917,486.287,81.17,488.442,81.17z"
          />
          <g id="替换2">
            <path
              style="fill: var(--w-primary-color)"
              d="M488.442,59.707h33.142c2.155,0,3.902,1.747,3.902,3.902l0,0c0,2.155-1.747,3.902-3.902,3.902
		h-33.142c-2.155,0-3.902-1.747-3.902-3.902l0,0C484.54,61.454,486.287,59.707,488.442,59.707z"
            />
          </g>
          <path
            style="fill: #74c042"
            d="M488.442,81.17h74.089c2.155,0,3.902,1.747,3.902,3.902v0c0,2.155-1.747,3.902-3.902,3.902h-74.089
	c-2.155,0-3.902-1.747-3.902-3.902v0C484.54,82.917,486.287,81.17,488.442,81.17z"
          />
          <ellipse style="fill: #ffffff" cx="525.487" cy="63.611" rx="6.825" ry="6.829" />
          <ellipse style="fill: #ffffff" cx="566.435" cy="85.073" rx="6.825" ry="6.829" />
        </svg>
      </div>
      <div class="assemble-guide-text">
        通过
        <span class="guide-link" @click="changeTab('page')">新建表单、新建页面</span>
        来快速搭建可视化的界面，在
        <span class="guide-link" @click="changeTab('dataModel')">对象</span>
        中可编辑数据结构，按需于
        <span class="guide-link" @click="changeTab('workflow')">流程</span>
        中创建数据的审批流程，结合
        <span class="guide-link" @click="changeTab('logic')">逻辑</span>
        中的逻辑编排以及
        <span class="guide-link" @click="changeTab('metadata')">元数据</span>
        中的基础数据定义，完成功能模块的可视化搭建和业务逻辑的实现。
      </div>
      <div class="flex f_wrap assemble-guide-menu" v-for="(pitem, pindex) in menu" :key="'p_' + pindex">
        <div v-for="(item, index) in pitem" :key="index" class="guide-item flex" @click="onClickCreateResource(item.code, item.text)">
          <div class="left-icon f_s_0" :style="{ background: item.bgColor }">
            <Icon :type="item.icon" :style="{ color: item.color }"></Icon>
          </div>
          <div class="f_g_1 left-text">
            <div class="text">
              {{ item.text }}
            </div>
            <div class="remark">
              {{ item.remark }}
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script type="text/babel">
export default {
  name: 'assembleGuide',
  props: {},
  components: {},
  computed: {},
  data() {
    return {
      img: '/static/svg/assemble-guide.svg',
      menu: [
        [
          {
            icon: 'pticon iconfont icon-xinjiantubiao-01',
            color: 'var(--w-primary-color)',
            bgColor: 'var(--w-primary-color-1)',
            text: '新建表单',
            remark: '收集数据、数据详情的呈现',
            code: 'CreateDyform'
          },
          {
            icon: 'pticon iconfont icon-ptkj-yemian',
            color: 'var(--w-success-color)',
            bgColor: 'var(--w-success-color-1)',
            text: '新建页面',
            remark: '数据视图、工作台、自定义页面',
            code: 'CreatePage'
          },
          {
            icon: 'pticon iconfont icon-ptkj-lianjiebangding',
            color: 'var(--w-warning-color)',
            bgColor: 'var(--w-warning-color-1)',
            text: '添加链接',
            remark: '链接到内部页面或外部网址',
            code: 'CreateLink'
          }
        ],
        [
          {
            icon: 'pticon iconfont icon-oa-tongjibaobiao',
            color: 'var(--w-warning-color)',
            bgColor: 'var(--w-warning-color-1)',
            text: '新建统计表',
            remark: '数据分析与统计图表',
            code: 'AResult'
          },
          {
            icon: 'pticon iconfont icon-daping-01',
            color: 'var(--w-primary-color)',
            bgColor: 'var(--w-primary-color-1)',
            text: '新建大屏',
            remark: '业务数据的分析与展示大屏',
            code: 'CreateBigscreen'
          }
        ]
      ]
    };
  },
  beforeCreate() {},
  created() {},
  beforeMount() {},
  mounted() {},
  methods: {
    onClickCreateResource(code, text) {
      this.$emit('onClickCreateResource', code, text);
    },
    changeTab(tab) {
      this.$emit('changeTab', tab);
    }
  }
};
</script>
<style lang="less" scoped>
.assemble-guide {
  width: 100%;
  height: 100%;
  background-color: var(--w-bg-color-layout);
  position: relative;

  &-content {
    width: 880px;
    margin: 0 auto 0;
    text-align: center;
    height: 610px;
    position: absolute;
    left: 50%;
    top: 50%;
    margin-top: -310px;
    margin-left: -440px;
  }
  .assemble-guide-img {
    width: 100%;
    height: 280px;
    text-align: center;
    svg {
      width: 700px;
      margin: 0 auto;
    }
  }

  .assemble-guide-text {
    color: var(--w-text-color-light);
    font-size: var(--w-font-size-base);
    text-align: center;
    margin-top: 20px;
    margin-bottom: 40px;
    .guide-link {
      color: var(--w-primary-color);
      cursor: pointer;
      &:hover {
        text-decoration: underline;
      }
    }
  }

  .assemble-guide-menu {
    .guide-item {
      width: 280px;
      background: var(--w-fill-color-base);
      transition: transform 0.3s ease; /* 平滑动画 */
      padding: 20px;
      margin-bottom: var(--w-margin-md);
      margin-right: var(--w-margin-md);
      border-radius: 4px;
      cursor: pointer;
      .left-icon {
        border-radius: 8px;
        width: 50px;
        height: 50px;
        padding: 4px;
        i {
          font-size: 28px;
        }
      }
      .left-text {
        padding-left: 10px;
        text-align: left;
      }
      .text {
        line-height: 32px;
        color: var(--w-text-color-dark);
        font-size: var(--w-font-size-base);
      }
      .remark {
        margin-top: 4px;
        color: var(--w-text-color-light);
        font-size: var(--w-font-size-sm);
      }

      &:hover {
        transform: translateY(-10px); /* 鼠标悬停时块向上移动 */
        box-shadow: 0px 9px 18px 0px rgba(0, 0, 0, 0.05);
      }

      &:last-child {
        margin-right: 0;
      }
    }
  }
}
</style>
